OpenFOAM/foam9tutorials/tutorials/combustion/buoyantReactingFoam/Lagrangian/hotBoxes/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          wallFilmRegion;

faceZones
(
    cubeFaces
    floorFaces
);

oneD            false;

sampleMode      nearestPatchFace;

extrudeModel    linearNormal;

nLayers         1;

expansionRatio  1;

adaptMesh       yes; // apply mapped to both regions

linearNormalCoeffs
{
    thickness       0.001;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
